# St7GetNumSRALoadCases

Returns the number of Load Excitation cases assigned for Spectral Response analysis.

long St7GetNumSRALoadCases(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

Number of Spectral Response load excitation cases.